#pragma once

// Dungeon Defenders (9.22) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class DunDefSpecial.DunDefBuff_Harbinger
// 0x0034 (0x0330 - 0x02FC)
class UDunDefBuff_Harbinger : public UDunDefBuff
{
public:
	TArray<int>                                        DifficultyTickDamageArray;                                // 0x02FC(0x000C)
	TArray<float>                                      DifficultyTickDamageMultiplierArray;                      // 0x0308(0x000C)
	float                                              HarbingerTimeoutRange;                                    // 0x0314(0x0004)
	float                                              TickDamageMultiplier;                                     // 0x0318(0x0004)
	float                                              Damage;                                                   // 0x031C(0x0004)
	class UParticleSystem*                             BeamEmitterTemplate;                                      // 0x0320(0x0004)
	class UParticleSystemComponent*                    beamInstance;                                             // 0x0324(0x0004)
	class UClass*                                      TickDamageType;                                           // 0x0328(0x0004)
	unsigned long                                      bDoLineOfSightCheck : 1;                                  // 0x032C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDefBuff_Harbinger");
		return ptr;
	}


	void DeactivateBuff();
	void BuffEffect();
	void Tick();
	void Initialize();
};


// Class DunDefSpecial.DunDefTower_SummonEnemy
// 0x015A (0x0972 - 0x0818)
class ADunDefTower_SummonEnemy : public ADunDefTower
{
public:
	struct FSummonedBoosts                             resistanceBoosting;                                       // 0x0818(0x0024)
	struct FSummonedBoosts                             movementSpeedBoosting;                                    // 0x083C(0x0024)
	struct FSummonedBoosts                             attackAnimSpeedBoosting;                                  // 0x0860(0x0024)
	TArray<TEnumAsByte<EPawnBoostType>>                allowedScalingTypes;                                      // 0x0884(0x000C)
	class ADunDefEnemy*                                myEnemyTemplate;                                          // 0x0890(0x0004)
	class UTexture2D*                                  SelectedIcon;                                             // 0x0894(0x0004)
	class UTexture2D*                                  PendingSelectionIcon;                                     // 0x0898(0x0004)
	class UTexture2D*                                  CmdIcon_MoveDef;                                          // 0x089C(0x0004)
	class UTexture2D*                                  CmdIcon_MoveOf;                                           // 0x08A0(0x0004)
	class UTexture2D*                                  CmdIcon_Attack;                                           // 0x08A4(0x0004)
	class UTexture2D*                                  CmdIcon_Follow;                                           // 0x08A8(0x0004)
	class UTexture2D*                                  CmdIcon_HoldDef;                                          // 0x08AC(0x0004)
	class UTexture2D*                                  CmdIcon_HoldOff;                                          // 0x08B0(0x0004)
	class UTexture2D*                                  currentAttackTargetIcon;                                  // 0x08B4(0x0004)
	class UTexture2D*                                  currentFollowTargetIcon;                                  // 0x08B8(0x0004)
	class ADunDefEnemy*                                myEnemyReference;                                         // 0x08BC(0x0004) (Edit)
	class ADunDefEnemyController*                      myEnemyControllerReference;                               // 0x08C0(0x0004)
	class AActor*                                      currentTargetActor;                                       // 0x08C4(0x0004)
	class AActor*                                      pendingTargetActor;                                       // 0x08C8(0x0004)
	unsigned long                                      bFollowOwner : 1;                                         // 0x08CC(0x0004)
	unsigned long                                      bCheckForFollowReturn : 1;                                // 0x08CC(0x0004)
	unsigned long                                      bAllowSelection : 1;                                      // 0x08CC(0x0004)
	unsigned long                                      bDisableCommandIconDrawing : 1;                           // 0x08CC(0x0004)
	unsigned long                                      bIsSelected : 1;                                          // 0x08CC(0x0004)
	unsigned long                                      bPendingSelection : 1;                                    // 0x08CC(0x0004)
	float                                              SelectedIconSize;                                         // 0x08D0(0x0004)
	float                                              UpdateCommandRate;                                        // 0x08D4(0x0004)
	struct FVector                                     SelectedIconOffset;                                       // 0x08D8(0x000C)
	float                                              ResistanceMultiplier;                                     // 0x08E4(0x0004)
	float                                              AttackRangeMultiplier;                                    // 0x08E8(0x0004)
	float                                              MovementSpeedMult;                                        // 0x08EC(0x0004)
	float                                              AnimAttackSpeedMult;                                      // 0x08F0(0x0004)
	float                                              ReplicatedDmgValue;                                       // 0x08F4(0x0004)
	float                                              ReplicatedAtkRange;                                       // 0x08F8(0x0004)
	struct FString                                     ResistanceString;                                         // 0x08FC(0x000C)
	struct FString                                     MovementSpeedString;                                      // 0x0908(0x000C)
	struct FString                                     AnimSpeedString;                                          // 0x0914(0x000C)
	struct FString                                     AttackAnimSpeedString;                                    // 0x0920(0x000C)
	float                                              HoldOffensive_TargetableRange;                            // 0x092C(0x0004)
	float                                              HoldDefensive_TargetableRange;                            // 0x0930(0x0004)
	float                                              followIconZOffset;                                        // 0x0934(0x0004)
	float                                              attackIconZOffset;                                        // 0x0938(0x0004)
	class USoundCue*                                   AcceptOrderSound;                                         // 0x093C(0x0004)
	class UParticleSystemComponent*                    SelectedParticle;                                         // 0x0940(0x0004)
	class UParticleSystemComponent*                    pendingSelectedParticle;                                  // 0x0944(0x0004)
	class UParticleSystemComponent*                    otherSelectedParticle;                                    // 0x0948(0x0004)
	TArray<class AActor*>                              commandInstigators;                                       // 0x094C(0x000C)
	struct FVector                                     currentCommandPoint;                                      // 0x0958(0x000C)
	struct FVector                                     pendingCommandPoint;                                      // 0x0964(0x000C)
	TEnumAsByte<ESummonedCommand>                      currentCommand;                                           // 0x0970(0x0001)
	TEnumAsByte<ESummonedCommand>                      previousCommand;                                          // 0x0971(0x0001)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDefTower_SummonEnemy");
		return ptr;
	}


	void UpdateBuffValues();
	void GetAttackDamage();
	void SpawnDefaultBuffs();
	void ClientDisableMovementReplication();
	void TransferTowerOwnership();
	void ForceSingleMove();
	void ForceMoveActor();
	void GetAlternateAggroActor();
	void GetPlayerTargetingDesirability();
	void GetTowerTargetingDesirability();
	void GetEnemyTargetingDesirability();
	void DrawToolTip();
	void DrawTowerToolTipStats();
	void GetBoostString();
	void GetBoostedTargets();
	void NotifyOfBoostedRemoval();
	void GetToolTipStatValue();
	void GetPawnBoostAmount();
	void HasPawnBoostingType();
	void TakeDamage();
	void GetAlternateActor();
	void GetHealth();
	void HealDamage();
	void AddHealth();
	void GetHealthPercent();
	void StartRepair();
	void GetToolTipText();
	void ScaleForHeroModifiers();
	void DrawMyHUD();
	void UpdateCommand();
	void HandleCommand();
	void SetCommand();
	void SetSelected();
	void SetPendingSelection();
	void CleanUpSummon();
	void Destroyed();
	void BaseChange();
	void SetUpEnemyValues();
	void SpawnMyEnemy();
	void InitializeForInstigator();
	void GetLastDamageTime();
	void HasBeenRendered();
	void UpdateEnemyCollisionValues();
	void UpdateReplicatedStatValues();
	void ExecReplicatedFunction();
	void ReplicatedEvent();
};


// Class DunDefSpecial.DunDefEmitterDamage
// 0x005C (0x0330 - 0x02D4)
class ADunDefEmitterDamage : public ADunDefEmitterSpawnable
{
public:
	float                                              MaximumMassMomentumScale;                                 // 0x02D4(0x0004)
	float                                              MassMomentumBaseScale;                                    // 0x02D8(0x0004)
	float                                              MassMomentumScaleExponent;                                // 0x02DC(0x0004)
	int                                                Damage;                                                   // 0x02E0(0x0004)
	float                                              Radius;                                                   // 0x02E4(0x0004)
	float                                              EffectRadius;                                             // 0x02E8(0x0004)
	class UClass*                                      MyDamageType;                                             // 0x02EC(0x0004)
	float                                              MyMomentum;                                               // 0x02F0(0x0004)
	float                                              DamageDelay;                                              // 0x02F4(0x0004)
	float                                              ScalingHeroStatExponentDamage;                            // 0x02F8(0x0004)
	float                                              ScalingHeroStatExponentRadius;                            // 0x02FC(0x0004)
	float                                              DamageFalloffExponent;                                    // 0x0300(0x0004)
	TEnumAsByte<ELevelUpValueType>                     ScalingHeroStatType;                                      // 0x0304(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0305(0x0003) MISSED OFFSET
	unsigned long                                      bUseAngleForDamage : 1;                                   // 0x0308(0x0004)
	unsigned long                                      bUseOwnerAsInstigator : 1;                                // 0x0308(0x0004)
	unsigned long                                      bScaleDrawScale : 1;                                      // 0x0308(0x0004)
	unsigned long                                      bUseSelfAsDamageCauser : 1;                               // 0x0308(0x0004)
	float                                              MaxTargetDeltaPitch;                                      // 0x030C(0x0004)
	float                                              MaxTargetDeltaYaw;                                        // 0x0310(0x0004)
	TArray<class UDunDefBuff*>                         BuffsToApplyOnHit;                                        // 0x0314(0x000C)
	class UDunDefBuff*                                 FirstTargetBuff;                                          // 0x0320(0x0004)
	TScriptInterface<class UIActorModifierInterface>   MyActorStatModifier;                                      // 0x0324(0x0008)
	float                                              PowerMult;                                                // 0x032C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDefEmitterDamage");
		return ptr;
	}


	void GetDamageCauser();
	void CheckValidAngle();
	void GetStatModifierObject();
	void GetStatValueByTag();
	void InitalizeActorStats();
	void STATIC_AllowSpawn();
	void HurtRadius();
	void DoDamage();
	void InitDamageEmitter();
	void PostBeginPlay();
};


// Class DunDefSpecial.CTF_PlayerAbility_PickupFlag
// 0x0008 (0x046C - 0x0464)
class ACTF_PlayerAbility_PickupFlag : public ADunDefPlayerAbility_GenericSpellTimer
{
public:
	class ACTF_Flag*                                   PickUpFlag;                                               // 0x0464(0x0004)
	class USoundCue*                                   StartPickingupSound;                                      // 0x0468(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_PlayerAbility_PickupFlag");
		return ptr;
	}


	void RequestPickup();
};


// Class DunDefSpecial.CTF_Flag
// 0x00B4 (0x02D8 - 0x0224)
class ACTF_Flag : public ADunDefDroppedItem
{
public:
	float                                              PickupOffset;                                             // 0x0224(0x0004)
	float                                              PickupWeighting;                                          // 0x0228(0x0004)
	struct FColor                                      ToolTipDrawColor;                                         // 0x022C(0x0004)
	struct FString                                     PickUpString;                                             // 0x0230(0x000C)
	float                                              ScorePerSecond;                                           // 0x023C(0x0004)
	float                                              HoldTimeForScore;                                         // 0x0240(0x0004)
	float                                              MaxPickupDistance;                                        // 0x0244(0x0004)
	float                                              DamageMultiplierIncreaseSpeed;                            // 0x0248(0x0004)
	float                                              HeldDamageMultiplier;                                     // 0x024C(0x0004)
	float                                              MaxDamageMultiplier;                                      // 0x0250(0x0004)
	float                                              DroppedAutoTeleportTime;                                  // 0x0254(0x0004)
	float                                              WaypointIconOffscreenScale;                               // 0x0258(0x0004)
	float                                              WaypointIconCenterScale;                                  // 0x025C(0x0004)
	float                                              WaypointCenterYOffset;                                    // 0x0260(0x0004)
	class USoundCue*                                   AllyPickedUpFlagSound;                                    // 0x0264(0x0004)
	class USoundCue*                                   EnemyPickedUpFlagSound;                                   // 0x0268(0x0004)
	class ADunDefEmitterSpawnable*                     PickedUpFlagEffects[0x2];                                 // 0x026C(0x0004)
	class UParticleSystemComponent*                    DroppedParticleComponent;                                 // 0x0274(0x0004)
	class UParticleSystemComponent*                    PickedUpParticleComponent;                                // 0x0278(0x0004)
	class UParticleSystem*                             TeamFlagEffects[0x2];                                     // 0x027C(0x0004)
	float                                              MiniMapIconSize;                                          // 0x0284(0x0004)
	float                                              MinimumTowerDistance;                                     // 0x0288(0x0004)
	float                                              OverlappingTowerCheckRadius;                              // 0x028C(0x0004)
	float                                              HolderJumpZMultiplier;                                    // 0x0290(0x0004)
	class UTexture2D*                                  MiniMapIcon;                                              // 0x0294(0x0004)
	class UTexture2D*                                  OnScreenWaypointTexture;                                  // 0x0298(0x0004)
	class UTexture2D*                                  OffScreenWaypointTexture;                                 // 0x029C(0x0004)
	struct FColor                                      MiniMapDefaultColor;                                      // 0x02A0(0x0004)
	class ADunDefPlayer*                               FlagHolder;                                               // 0x02A4(0x0004) (Edit)
	float                                              currentScoreAccumulation;                                 // 0x02A8(0x0004)
	unsigned long                                      bIsPickedUp : 1;                                          // 0x02AC(0x0004)
	unsigned long                                      bGivePointsForPossesion : 1;                              // 0x02AC(0x0004)
	unsigned long                                      bTeamBasedFlag : 1;                                       // 0x02AC(0x0004)
	unsigned long                                      bAllowTeamReset : 1;                                      // 0x02AC(0x0004)
	unsigned long                                      bAtBase : 1;                                              // 0x02AC(0x0004) (Edit)
	class ACTF_FlagBase*                               myBase;                                                   // 0x02B0(0x0004)
	int                                                myTeamIndex;                                              // 0x02B4(0x0004) (Edit)
	int                                                CapturePoints;                                            // 0x02B8(0x0004)
	struct FName                                       TeamParticleColorParam;                                   // 0x02BC(0x0008)
	class ADunDefEmitterSpawnable*                     CapturedFlagEffects[0x2];                                 // 0x02C4(0x0004)
	struct FString                                     flagCapturedMessage;                                      // 0x02CC(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_Flag");
		return ptr;
	}


	void SetAtBase();
	void SetDroppedParticleColor();
	void SetTeam();
	void InitFlag();
	void AutoTeleport();
	void AdjustDamage();
	void PreventTowerAtPoint();
	void AllowTowerAtPoint();
	void CheckAllowance();
	void PhysicsVolumeChange();
	void FellOutOfWorld();
	void ResetCollision();
	void DisableCollision();
	void IsInAuraOrTrap();
	void CaptureFlag();
	void ReturnToBase();
	void DropFlag();
	void PickUpFlag();
	void BeginBeingPickedUp();
	void CanBePickedUp();
	void DrawMiniMapIcon();
	void GetActivationOffset();
	void GetActivationWeighting();
	void Client_Activate();
	void Server_Activate();
	void AllowActivation();
	void GetToolTipPriority();
	void TakesToolTipPriority();
	void ContinueDrawingToolTip();
	void DrawToolTip();
	void Destroyed();
	void PostBeginPlay();
	void DrawMyHUD();
	void OnlyDrawHUDForOwner();
	void ExecReplicatedFunction();
	void ReplicatedEvent();
};


// Class DunDefSpecial.CTF_UIGlobalHUD
// 0x0030 (0x0738 - 0x0708)
class UCTF_UIGlobalHUD : public UUI_GlobalHUD
{
public:
	class UUILabel*                                    MyTeamNameLabel;                                          // 0x0708(0x0004)
	class UUIPanel*                                    ScorePanel_2;                                             // 0x070C(0x0004)
	class UUIPanel*                                    ScorePanel_3;                                             // 0x0710(0x0004)
	class UUILabel*                                    Team1PlayerList;                                          // 0x0714(0x0004)
	class UUILabel*                                    Team2PlayerList;                                          // 0x0718(0x0004)
	class UUILabel*                                    TeamName_2;                                               // 0x071C(0x0004)
	class UUILabel*                                    TeamName_3;                                               // 0x0720(0x0004)
	class UUILabel*                                    Team1ScoreList;                                           // 0x0724(0x0004)
	class UUILabel*                                    Team2ScoreList;                                           // 0x0728(0x0004)
	class UUILabel*                                    Team1KillList;                                            // 0x072C(0x0004)
	class UUILabel*                                    Team2KillList;                                            // 0x0730(0x0004)
	struct FColor                                      LocalPlayerHighLightColor;                                // 0x0734(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_UIGlobalHUD");
		return ptr;
	}


	void GetUITeamLists();
	void GetColorString();
	void UpdateTeamPanels();
	void Update();
	void UpdateCompetitive();
};


// Class DunDefSpecial.CTF_DDPRI
// 0x0010 (0x0380 - 0x0370)
class ACTF_DDPRI : public ADunDefPlayerReplicationInfo
{
public:
	int                                                CTF_MyCurrentTowerUnits;                                  // 0x0370(0x0004)
	int                                                CTF_MyMaxTowerUnits;                                      // 0x0374(0x0004)
	unsigned long                                      IsReadyToSpawn : 1;                                       // 0x0378(0x0004)
	int                                                MatchKills;                                               // 0x037C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_DDPRI");
		return ptr;
	}


	void IsFriendlyToLocal();
	void PrintHeroLevelUpMessage();
	void PrintNewHeroMessage();
	void SetReadyToSpawn();
	void GetTeamName();
	void GetTeamColor();
	void Destroyed();
	void AddToTeam();
	void ReplicatedEvent();
};


// Class DunDefSpecial.CTF_DDGRI
// 0x00EC (0x08CC - 0x07E0)
class ACTF_DDGRI : public ADDGRI_Competitive
{
public:
	struct FCTFTeamData                                CTFTeamDatas[0x2];                                        // 0x07E0(0x0034)
	struct FColor                                      NeutralColor;                                             // 0x0848(0x0004)
	class ACTF_PlayerAbility_PickupFlag*               CTFPickupFlagAbilityTemplate;                             // 0x084C(0x0004)
	class UTexture2D*                                  TeamIconTexture;                                          // 0x0850(0x0004)
	class UTexture2D*                                  FlagIcon;                                                 // 0x0854(0x0004)
	class ACTF_Flag*                                   TheFlag;                                                  // 0x0858(0x0004)
	class ACTF_Flag*                                   TheSecondFlag;                                            // 0x085C(0x0004)
	struct FString                                     FlagIconPath;                                             // 0x0860(0x000C)
	int                                                WinningTeam;                                              // 0x086C(0x0004)
	unsigned long                                      bAutoBalanceTeams : 1;                                    // 0x0870(0x0004)
	unsigned long                                      bIsGameReady : 1;                                         // 0x0870(0x0004)
	unsigned long                                      bUsePersonalTowerUnits : 1;                               // 0x0870(0x0004)
	unsigned long                                      bAllowCountDown : 1;                                      // 0x0870(0x0004)
	unsigned long                                      bPrintWinningPlayerMessage : 1;                           // 0x0870(0x0004)
	unsigned long                                      bDisplayPlayerScore : 1;                                  // 0x0870(0x0004)
	float                                              GameStartTime;                                            // 0x0874(0x0004)
	float                                              FlagHoldingGroundSpeed;                                   // 0x0878(0x0004)
	int                                                LastSentGameTime;                                         // 0x087C(0x0004)
	struct FString                                     EndGameLabelString;                                       // 0x0880(0x000C)
	int                                                WinCTFManaBonus[0x8];                                     // 0x088C(0x0004)
	int                                                WinExpBonus[0x8];                                         // 0x08AC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_DDGRI");
		return ptr;
	}


	void AllowedToTeleport();
	void DoDeathNotification();
	void GetJumpZMultiplier();
	void ExtraDrawHUDInterface();
	void CustomUpdatePlayerScoreLabel();
	void AllowDeathSpectatorMode();
	void ModifyPlayerGroundSpeed();
	void GetGameOverLabelColor();
	void GetVictoryLabelColor();
	void GetGameOverLabelString();
	void GetVictoryLabelString();
	void OverrideEndGameLabel();
	void GetWinningPRI();
	void GetDataListEntries();
	void GetTeamIcon();
	void IsTeamCompetitive();
	void AllowChatBetween();
	void GetTeamThatHasFlag();
	void DoLevelVictory();
	void GiveWinningBonus();
	void WonGame();
	void CheckAllReady();
	void CheckReadyPlayers();
	void SetAllowCountDown();
	void AllowGameCountDown();
	void SetGameReady();
	void SetGameTime();
	void UpdateGameTime();
	void Tick();
	void FilloutTeams();
	void FlushTeams();
	void AutoBalanceTeams();
	void AutoSortTeams();
	void GetLowestBalancedTeam();
	void IncrementTeamScore();
	void PostBeginPlay();
	void ModifyCustomColors();
	void DrawExtraPlayerFloatingHUD();
	void GetTeamScores();
	void Server_AddGRIHeroAbilities();
	void GetColorString();
	void GetTeamLists();
	void GetCompetitivePlayerList();
	void DestroyTowerOnOwnerLeft();
	void GetMaxTowerUnits();
	void GetAltCurrentTowerUnits();
	void GetCurrentTowerUnits();
	void CanPlaceTowerUnitCost();
	void RemovedTower();
	void AddedTower();
	void RemovePlayerFromTeam();
	void AddPlayerToTeam();
	void RemoveFromAnyTeams();
	void GetSmallestTeam();
	void ExecReplicatedFunction();
};


// Class DunDefSpecial.CTF_DDPC
// 0x0008 (0x0B40 - 0x0B38)
class ACTF_DDPC : public ADunDefPlayerController
{
public:
	class UUI_TeamSelect*                              TeamSelectUITemplate;                                     // 0x0B38(0x0004)
	class ACTF_Flag*                                   myHeldFlag;                                               // 0x0B3C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_DDPC");
		return ptr;
	}


	void AdjustDamage();
	void PawnDied();
	void GiveFlag();
	void SetIsReady();
	void SetDesiredTeam();
	void CreateHUD();
	void LocalAttemptSpawn();
	void ServerRestartPlayer();
	void ShowTeamSelectionUI();
};


// Class DunDefSpecial.CTD_DDGRI
// 0x000C (0x08D8 - 0x08CC)
class ACTD_DDGRI : public ACTF_DDGRI
{
public:
	TArray<float>                                      MoveRepSizes;                                             // 0x08CC(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTD_DDGRI");
		return ptr;
	}


	void AllowedToTeleport();
	void DoLevelVictory();
	void Tick();
	void GetSkipBuildPhaseString();
	void DrawExtraPlayerFloatingHUD();
	void Server_AddGRIHeroAbilities();
	void DestroyTowerOnOwnerLeft();
	void AllowActivatingCrystal();
	void SetGameReady();
};


// Class DunDefSpecial.UI_TeamSelect
// 0x002C (0x0668 - 0x063C)
class UUI_TeamSelect : public UDunDefUIScene
{
public:
	class UUIScriptWidget_Button*                      ReadyButton;                                              // 0x063C(0x0004)
	class UUIButton_Scripted*                          SwapTeamButton;                                           // 0x0640(0x0004)
	class UUIButton_Scripted*                          AutoSetTeams;                                             // 0x0644(0x0004)
	class UUIButton_Scripted*                          TeamButton_2;                                             // 0x0648(0x0004)
	class UUIButton_Scripted*                          TeamButton_3;                                             // 0x064C(0x0004)
	class UUILabel*                                    GameStartCountdown;                                       // 0x0650(0x0004)
	class UUILabel*                                    Team1PlayerList;                                          // 0x0654(0x0004)
	class UUILabel*                                    Team2PlayerList;                                          // 0x0658(0x0004)
	class UUILabel*                                    TeamName_2;                                               // 0x065C(0x0004)
	class UUILabel*                                    TeamName_3;                                               // 0x0660(0x0004)
	float                                              GameStartTime;                                            // 0x0664(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.UI_TeamSelect");
		return ptr;
	}


	void OnInterceptedInputKey();
	void NotifyWidgetClicked();
	void Update();
	void SceneActivated();
};


// Class DunDefSpecial.CTF_GameInfo
// 0x0008 (0x0554 - 0x054C)
class ACTF_GameInfo : public AGameInfo_Competitive
{
public:
	int                                                TeamPointsForKill;                                        // 0x054C(0x0004)
	unsigned long                                      bPreventCompetitivePlayerDamage : 1;                      // 0x0550(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_GameInfo");
		return ptr;
	}


	void AdjustDTDamage();
	void AdjustPawnDamage();
	void GetPlayerTeamForStart();
	void CheckScore();
	void ScoreKill();
	void ScoreObjective();
	void AddObjectiveScore();
	void PlayerReplicationInfoInitialized();
	void DoPlayerLeaving();
	void SpawnPlayerController();
};


// Class DunDefSpecial.CTD_GameInfo
// 0x000C (0x0560 - 0x0554)
class ACTD_GameInfo : public ACTF_GameInfo
{
public:
	TArray<float>                                      OgreDifficultyOffsets;                                    // 0x0554(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTD_GameInfo");
		return ptr;
	}


	void WaveSpawnerCreateEnemy();
	void RatePlayerStart();
	void PostBeginPlay();
};


// Class DunDefSpecial.CTF_FlagBase
// 0x0068 (0x0284 - 0x021C)
class ACTF_FlagBase : public AActor
{
public:
	int                                                myTeamIndex;                                              // 0x021C(0x0004) (Edit)
	class ADunDefEmitterSpawnable*                     CaptureEmitterTemplate[0x2];                              // 0x0220(0x0004)
	class ADunDefEmitterSpawnable*                     FlagStoleEmitterTemplate[0x2];                            // 0x0228(0x0004)
	class UParticleSystemComponent*                    MyParticleComponent;                                      // 0x0230(0x0004)
	class ACTF_Flag*                                   myFlagTemplate;                                           // 0x0234(0x0004)
	struct FName                                       ParticleColorName;                                        // 0x0238(0x0008)
	TArray<class APlayerStart*>                        myAssociatedStarts;                                       // 0x0240(0x000C)
	TArray<class ADunDefTeamTowerVolume*>              myAssociatedVolumes;                                      // 0x024C(0x000C)
	class ACTF_Flag*                                   myFlag;                                                   // 0x0258(0x0004)
	unsigned long                                      bBaseInited : 1;                                          // 0x025C(0x0004)
	class UCylinderComponent*                          myCollisionComponent;                                     // 0x0260(0x0004)
	float                                              MiniMapIconSize;                                          // 0x0264(0x0004)
	float                                              MinimumTowerDistance;                                     // 0x0268(0x0004)
	class UTexture2D*                                  MiniMapIcon;                                              // 0x026C(0x0004)
	TArray<class UMaterialInstanceConstant*>           ZoneMICs;                                                 // 0x0270(0x000C)
	struct FName                                       ZoneMICParamName;                                         // 0x027C(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_FlagBase");
		return ptr;
	}


	void PreventTowerAtPoint();
	void AllowTowerAtPoint();
	void CheckAllowance();
	void DrawMiniMapIcon();
	void SpawnFlag();
	void FlagTaken();
	void FlagReturned();
	void DoCaptureEffects();
	void ScoreFlag();
	void Touch();
	void InitBase();
	void SetTeamIndex();
	void PostBeginPlay();
	void ExecReplicatedFunction();
	void ReplicatedEvent();
};


// Class DunDefSpecial.CTF_MultiFlag_GameInfo
// 0x0004 (0x0558 - 0x0554)
class ACTF_MultiFlag_GameInfo : public ACTF_GameInfo
{
public:
	unsigned long                                      bSetRandomTeamSides : 1;                                  // 0x0554(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_MultiFlag_GameInfo");
		return ptr;
	}


	void RatePlayerStart();
	void PostBeginPlay();
};


// Class DunDefSpecial.DunDefTeamTowerVolume
// 0x0004 (0x025C - 0x0258)
class ADunDefTeamTowerVolume : public AVolume
{
public:
	int                                                myTeamIndex;                                              // 0x0258(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDefTeamTowerVolume");
		return ptr;
	}


	void SetMyTeam();
	void Destroyed();
	void PostBeginPlay();
	void AllowTowerAtPoint();
	void PreventTowerAtPoint();
	void CheckAllowance();
	void ExecReplicatedFunction();
};


// Class DunDefSpecial.CTFM_DDGRI
// 0x0000 (0x08CC - 0x08CC)
class ACTFM_DDGRI : public ACTF_DDGRI
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTFM_DDGRI");
		return ptr;
	}

};


// Class DunDefSpecial.CTF_UIGameStats
// 0x0024 (0x0FE4 - 0x0FC0)
class UCTF_UIGameStats : public UUI_GameStats
{
public:
	class UUILabel*                                    Team1PlayerList;                                          // 0x0FC0(0x0004)
	class UUILabel*                                    Team2PlayerList;                                          // 0x0FC4(0x0004)
	class UUILabel*                                    TeamName_2;                                               // 0x0FC8(0x0004)
	class UUILabel*                                    TeamName_3;                                               // 0x0FCC(0x0004)
	class UUILabel*                                    Team1ScoreList;                                           // 0x0FD0(0x0004)
	class UUILabel*                                    Team2ScoreList;                                           // 0x0FD4(0x0004)
	class UUILabel*                                    Team1KillList;                                            // 0x0FD8(0x0004)
	class UUILabel*                                    Team2KillList;                                            // 0x0FDC(0x0004)
	struct FColor                                      LocalPlayerHighLightColor;                                // 0x0FE0(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_UIGameStats");
		return ptr;
	}


	void GetUITeamLists();
	void GetColorString();
	void UpdateTeamPanels();
	void CustomInit();
};


// Class DunDefSpecial.DunDef_SeqAct_AddPlatformToVerticalTowerMover
// 0x0000 (0x00E8 - 0x00E8)
class UDunDef_SeqAct_AddPlatformToVerticalTowerMover : public USequenceAction
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDef_SeqAct_AddPlatformToVerticalTowerMover");
		return ptr;
	}


	void Activated();
};


// Class DunDefSpecial.DunDef_VerticalTowerMover
// 0x0014 (0x0230 - 0x021C)
class ADunDef_VerticalTowerMover : public AActor
{
public:
	unsigned long                                      bBuildPhaseOnly : 1;                                      // 0x021C(0x0004)
	TArray<struct FPlatformInfo>                       Platforms;                                                // 0x0220(0x000C)
	int                                                TicksSinceUpdate;                                         // 0x022C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDef_VerticalTowerMover");
		return ptr;
	}


	void Tick();
	void MoveTowers();
	void RebuildTowerCache();
	void AddInterpActor();
};


// Class DunDefSpecial.DunDef_SeqAct_CheckToUnlockAchievements
// 0x0001 (0x00E9 - 0x00E8)
class UDunDef_SeqAct_CheckToUnlockAchievements : public USequenceAction
{
public:
	TEnumAsByte<EAchievementCheckSet>                  AchievementCheckSet;                                      // 0x00E8(0x0001)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDef_SeqAct_CheckToUnlockAchievements");
		return ptr;
	}


	void Activated();
};


// Class DunDefSpecial.DunDef_SeqAct_CTDWinGameForTeam
// 0x0004 (0x00EC - 0x00E8)
class UDunDef_SeqAct_CTDWinGameForTeam : public USequenceAction
{
public:
	int                                                WinningTeamIndex;                                         // 0x00E8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDef_SeqAct_CTDWinGameForTeam");
		return ptr;
	}


	void Activated();
};


// Class DunDefSpecial.DunDef_SeqAct_GetMVP
// 0x0000 (0x00E8 - 0x00E8)
class UDunDef_SeqAct_GetMVP : public USequenceAction
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDef_SeqAct_GetMVP");
		return ptr;
	}


	void Activated();
};


// Class DunDefSpecial.DunDef_SeqAct_HideGlobalUIScene
// 0x0008 (0x00F0 - 0x00E8)
class UDunDef_SeqAct_HideGlobalUIScene : public USequenceAction
{
public:
	class UDunDefUIScene*                              aUIScene;                                                 // 0x00E8(0x0004)
	unsigned long                                      bForceClose : 1;                                          // 0x00EC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDef_SeqAct_HideGlobalUIScene");
		return ptr;
	}


	void Activated();
};


// Class DunDefSpecial.DunDefTower_TripWire
// 0x0100 (0x09E4 - 0x08E4)
class ADunDefTower_TripWire : public ADunDefTower_DetonationType
{
public:
	TArray<struct FBeamTrippers>                       currentBeamTrippers;                                      // 0x08E4(0x000C)
	TArray<class ADunDefTower_TripWire*>               ChildNodes;                                               // 0x08F0(0x000C)
	class ADunDefTower_TripWire*                       ChildNode;                                                // 0x08FC(0x0004) (Edit)
	unsigned long                                      bIsChildNode : 1;                                         // 0x0900(0x0004)
	unsigned long                                      bUseDetonation : 1;                                       // 0x0900(0x0004)
	unsigned long                                      bShowInactiveEffectOnDeactivate : 1;                      // 0x0900(0x0004)
	unsigned long                                      bActiveDamage : 1;                                        // 0x0900(0x0004)
	unsigned long                                      bShutDown : 1;                                            // 0x0900(0x0004)
	unsigned long                                      bDoesStun : 1;                                            // 0x0900(0x0004)
	unsigned long                                      bContinuousProcs : 1;                                     // 0x0900(0x0004)
	unsigned long                                      bAllowTargeting : 1;                                      // 0x0900(0x0004)
	unsigned long                                      bDoesTracing : 1;                                         // 0x0900(0x0004)
	unsigned long                                      bActiveOnStart : 1;                                       // 0x0900(0x0004)
	unsigned long                                      bWantsChildTodrawUpgradeOverlay : 1;                      // 0x0900(0x0004)
	unsigned long                                      bSetFullCollisionForChild : 1;                            // 0x0900(0x0004)
	unsigned long                                      bDoClientTrace : 1;                                       // 0x0900(0x0004)
	unsigned long                                      bMoving : 1;                                              // 0x0900(0x0004)
	unsigned long                                      bDidSingleHit : 1;                                        // 0x0900(0x0004)
	class ADunDefTower_TripWire*                       ParentNode;                                               // 0x0904(0x0004)
	float                                              WireDistanceForMaxCost;                                   // 0x0908(0x0004)
	float                                              WireDistanceForMinCost;                                   // 0x090C(0x0004)
	int                                                TowerUnitCostMax;                                         // 0x0910(0x0004)
	struct FVector                                     BeamTraceExtent;                                          // 0x0914(0x000C)
	float                                              ActiveEffectLingerTime;                                   // 0x0920(0x0004)
	class UParticleSystemComponent*                    BeamEffect;                                               // 0x0924(0x0004)
	class UParticleSystemComponent*                    InActiveBeamEffect;                                       // 0x0928(0x0004)
	class UParticleSystemComponent*                    InActiveBeamEndPointEffect;                               // 0x092C(0x0004)
	class UParticleSystemComponent*                    ActiveBeamEndPointEffect;                                 // 0x0930(0x0004)
	class UParticleSystemComponent*                    PreDetonationEndPointEffect;                              // 0x0934(0x0004)
	struct FName                                       BeamSocketName;                                           // 0x0938(0x0008)
	int                                                BaseDamagePerTick;                                        // 0x0940(0x0004)
	float                                              DmgProcInterval;                                          // 0x0944(0x0004)
	float                                              ActiveDuration;                                           // 0x0948(0x0004)
	class UClass*                                      BeamDamageType;                                           // 0x094C(0x0004)
	float                                              TimeTillDetonate;                                         // 0x0950(0x0004)
	float                                              LifeEnergy;                                               // 0x0954(0x0004)
	float                                              LifeEnergyDecrease;                                       // 0x0958(0x0004)
	float                                              LifeEnergyDecreasePerPawnAffected;                        // 0x095C(0x0004)
	float                                              HealAmountMultiplier;                                     // 0x0960(0x0004)
	float                                              NetUpdateFrequencyWhenRepairing;                          // 0x0964(0x0004)
	float                                              LastRepairIncrementTime;                                  // 0x0968(0x0004)
	int                                                MaxLifeEnergy;                                            // 0x096C(0x0004)
	TArray<class UClass*>                              NoStunDamageTypes;                                        // 0x0970(0x000C)
	class UParticleSystem*                             StunnedEffect;                                            // 0x097C(0x0004)
	float                                              BaseStunTime;                                             // 0x0980(0x0004)
	float                                              MaxZHeight;                                               // 0x0984(0x0004)
	float                                              MinZHeight;                                               // 0x0988(0x0004)
	class UTexture2D*                                  MiniMapBeamTexture;                                       // 0x098C(0x0004)
	float                                              MiniMapBeamWidth;                                         // 0x0990(0x0004)
	float                                              StunTimeExponent;                                         // 0x0994(0x0004)
	TEnumAsByte<ELevelUpValueType>                     StunStat;                                                 // 0x0998(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0999(0x0003) MISSED OFFSET
	class USoundCue*                                   DetonateSound;                                            // 0x099C(0x0004)
	class USoundCue*                                   TripCue;                                                  // 0x09A0(0x0004)
	float                                              LinearDUHealthScaleValue;                                 // 0x09A4(0x0004)
	float                                              DUHealthExp;                                              // 0x09A8(0x0004)
	struct FString                                     StunTimeString;                                           // 0x09AC(0x000C)
	struct FString                                     StunIntervalEndString;                                    // 0x09B8(0x000C)
	class UAudioComponent*                             AmbientSoundComponent;                                    // 0x09C4(0x0004)
	struct FColor                                      MiniMapBeamColor;                                         // 0x09C8(0x0004)
	float                                              StunMultiplier;                                           // 0x09CC(0x0004)
	float                                              LastCleanUpTime;                                          // 0x09D0(0x0004)
	struct FVector                                     spawnInPoint;                                             // 0x09D4(0x000C) (Edit)
	int                                                modifiedDUCost;                                           // 0x09E0(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDefTower_TripWire");
		return ptr;
	}


	void STATIC_StaticGetTowerScale();
	void AllowAbilityMove();
	void TransferTowerOwnership();
	void CheckAssociateWithHero();
	void CanDetonate();
	void HasCharges();
	void GetSellWorth();
	void GetEnemyTargetingDesirability();
	void DrawMiniMapIcon();
	void HealDetonationStyle();
	void GetAlternateActor();
	void IsMultiActorTower();
	void DrawUpgradeOverlay();
	void GetGlobalTowerHealthMultiplier();
	void PerformFullHeal();
	void SetRadiusScale();
	void DrawTowerToolTipStats();
	void GetToolTipText();
	void ScaleForHeroModifiers();
	void ScaleHealthMultiplier();
	void ReportSummoned();
	void UpdateTowerRatingMaterial();
	void NeedsRepair();
	void GetHealthPercent();
	void HealDamage();
	void HealPctOfMaxHealth();
	void GetHealth();
	void IncrementRepair();
	void IncrementDetonationRepair();
	void GetCurrentRepairPercentage();
	void StartRepair();
	void GetTimeToRepair();
	void GetCostToRepair();
	void GetTimeOfTotalRepair();
	void Died();
	void ReportedDeath();
	void ReportDeath();
	void DecreaseLifeEnergy();
	void ContinueDrawingToolTip();
	void DrawToolTip();
	void Sell();
	void Destroyed();
	void PlaySellFX();
	void Detonate();
	void ChildEndDetonate();
	void ChildDetonate();
	void RemoveStunnedActor();
	void CanStun();
	void AddStunnedActor();
	void ClearBeamTrippers();
	void GetAttackDuration();
	void ResetTrip();
	void DeactivateTrip();
	void ActivateTrip();
	void DrawMyHUD();
	void GetTrapDamageMultiplier();
	void GetDamageMultiplier();
	void GetAttackDamage();
	void GetStunTime();
	void RemoveTowerBooster();
	void AddTowerBooster();
	void UpdateStuns();
	void GetAttackRate();
	void DoTracing();
	void UnTouch();
	void Touch();
	void SetDetonateTimer();
	void GetEndPoint();
	void GetBeamStartLoc();
	void UpdateMovementBeams();
	void Tick();
	void ClientSingleSetMovement();
	void ForceSingleMove();
	void DisableSingleMovementReplication();
	void EnableSingleMovementReplicationTimer();
	void DisableMovementReplication();
	void EnableMovementReplicationTimer();
	void SetDUCost();
	void GetNextUpgradeLevel();
	void GetTimeToUpgradeTower();
	void GetCostToUpgradeTower();
	void GetTowerUpgradeLevelStatModifier();
	void ChildDoUpgrade();
	void ChildDoDowngrade();
	void DoDowngrade();
	void DoUpgrade();
	void CanBeUpgraded();
	void ShutDownBeamEffects();
	void ActivateBeamEffects();
	void ActivateBeam();
	void GetBeamPoint();
	void GetCollisionPoint();
	void SetPlacementPoints();
	void InitializeForInstigator();
	void SetUpCollisionMesh();
	void InitalizeStatObject();
	void OnDestroy_RemoveFromTargetableList();
	void OnPostBeginPlay_AddToTargetableList();
	void PostBeginPlay();
	void SetUseHealthBarMat();
	void ExecReplicatedFunction();
	void ReplicatedEvent();
};


// Class DunDefSpecial.DunDefTower_TripPhysical
// 0x00B0 (0x0A94 - 0x09E4)
class ADunDefTower_TripPhysical : public ADunDefTower_TripWire
{
public:
	struct FVector                                     TargetingLocation;                                        // 0x09E4(0x000C)
	class UParticleSystemComponent*                    TopBeam;                                                  // 0x09F0(0x0004)
	class UParticleSystemComponent*                    SideBeamA;                                                // 0x09F4(0x0004)
	class UParticleSystemComponent*                    SideBeamB;                                                // 0x09F8(0x0004)
	class UParticleSystemComponent*                    ParticlePlane;                                            // 0x09FC(0x0004)
	class UParticleSystemComponent*                    TopPointA;                                                // 0x0A00(0x0004)
	class UParticleSystemComponent*                    TopPointB;                                                // 0x0A04(0x0004)
	struct FName                                       TopBoneControllerName;                                    // 0x0A08(0x0008)
	struct FName                                       TopSocketName;                                            // 0x0A10(0x0008)
	float                                              PlaneFadeTime;                                            // 0x0A18(0x0004)
	float                                              CollisionWidth;                                           // 0x0A1C(0x0004)
	class UMaterialInterface*                          PlaneMaterial;                                            // 0x0A20(0x0004)
	class USoundCue*                                   ExpandSound;                                              // 0x0A24(0x0004)
	struct FVector                                     MeshOffSet;                                               // 0x0A28(0x000C)
	struct FName                                       BottomSocketName;                                         // 0x0A34(0x0008)
	unsigned long                                      bUseBottomSocket : 1;                                     // 0x0A3C(0x0004)
	unsigned long                                      bAllowAbilityMove : 1;                                    // 0x0A3C(0x0004)
	unsigned long                                      bDoSpawnTick : 1;                                         // 0x0A3C(0x0004)
	unsigned long                                      bBeamStarted : 1;                                         // 0x0A3C(0x0004)
	unsigned long                                      bActivatedBeam : 1;                                       // 0x0A3C(0x0004)
	unsigned long                                      bModifyActorLocation : 1;                                 // 0x0A3C(0x0004)
	unsigned long                                      bSetCollisionMeshAsComponent : 1;                         // 0x0A3C(0x0004)
	unsigned long                                      bClientRecievedLoc : 1;                                   // 0x0A3C(0x0004)
	class UMaterialInstanceConstant*                   MyPlaneMIC;                                               // 0x0A40(0x0004)
	class USkelControlSingleBone*                      TopBoneController;                                        // 0x0A44(0x0004)
	float                                              ScaleInTime;                                              // 0x0A48(0x0004)
	float                                              StartScaleTime;                                           // 0x0A4C(0x0004)
	struct FVector                                     topEndPointA;                                             // 0x0A50(0x000C)
	struct FVector                                     topEndPointB;                                             // 0x0A5C(0x000C)
	struct FVector                                     currentPointA;                                            // 0x0A68(0x000C)
	struct FVector                                     currentPointB;                                            // 0x0A74(0x000C)
	float                                              distanceBetween;                                          // 0x0A80(0x0004)
	float                                              theTime;                                                  // 0x0A84(0x0004)
	struct FVector                                     MeshTranslation;                                          // 0x0A88(0x000C) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDefTower_TripPhysical");
		return ptr;
	}


	void DisableAbilityMove();
	void AllowAbilityMove();
	void ClientDisableMovementReplication();
	void BaseChange();
	void ForceMoveActor();
	void GetSelectionLocation();
	void IsPhysicalTower();
	void DrawMiniMapIcon();
	void UpdateMovementBeams();
	void IsPreviousToolTipActor();
	void UpdateDamageFlashing();
	void PerformFullHeal();
	void HealDamage();
	void IncrementRepair();
	void GetCurrentRepairPercentage();
	void StartRepair();
	void GetTimeToRepair();
	void GetCostToRepair();
	void GetTimeOfTotalRepair();
	void GetToolTipText();
	void GetGlobalTowerHealthMultiplier();
	void Bump();
	void GetOverrideTargetComponent();
	void DrawToolTip();
	void GetHealthPercent();
	void GetHealth();
	void AddHealth();
	void ActivateBeamEffects();
	void ShutDownBeamEffects();
	void ActivateTrip();
	void DrawMyHUD();
	void NeedsRepair();
	void SubtractHealth();
	void TakeDamage();
	void GetAttackRangeOffset();
	void GetTargetingLocation();
	void GetPhysicalTowerDamageMultiplier();
	void GetPhysicalTowerHealthMultiplier();
	void GetAuraDamageMultiplier();
	void UseForTowerSelectionPassThrough();
	void GetTowerTargetingDesirability();
	void GetPlayerTargetingDesirability();
	void ActivatePlaneBeam();
	void ActivateBeam();
	void ModifyTranslation();
	void SetUpCollisionMesh();
	void GetCollisionPoint();
	void GetSecondBeamPoint();
	void ScaleInBeams();
	void StartBeams();
	void PostBeginPlay();
	void SetPlacementPoints();
	void ReplicatedEvent();
};


// Class DunDefSpecial.DunDefPlayer_Hovering
// 0x002C (0x0DAC - 0x0D80)
class ADunDefPlayer_Hovering : public ADunDefPlayer
{
public:
	struct FName                                       HoveringBlenderName;                                      // 0x0D80(0x0008)
	float                                              HoverOnBlendTime;                                         // 0x0D88(0x0004)
	float                                              HoverOffBlendTime;                                        // 0x0D8C(0x0004)
	class USoundCue*                                   HoveringStartSound;                                       // 0x0D90(0x0004)
	class USoundCue*                                   HoveringStopSound;                                        // 0x0D94(0x0004)
	class UParticleSystemComponent*                    HoveringParticleSystem;                                   // 0x0D98(0x0004)
	class UAudioComponent*                             HoveringLoopSound;                                        // 0x0D9C(0x0004)
	struct FName                                       HoveringParticleSystemAttachSocketName;                   // 0x0DA0(0x0008)
	class UAnimNodeBlend*                              HoveringBlender;                                          // 0x0DA8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDefPlayer_Hovering");
		return ptr;
	}


	void PostBeginPlay();
	void StopHovering();
	void StartHovering();
	void ExecReplicatedFunction();
};


// Class DunDefSpecial.DunDefPlayer_Summoner
// 0x00A8 (0x0E54 - 0x0DAC)
class ADunDefPlayer_Summoner : public ADunDefPlayer_Hovering
{
public:
	struct FName                                       WheelEntryToOpenOnFire;                                   // 0x0DAC(0x0008)
	struct FName                                       AbilityToActivateOnFire;                                  // 0x0DB4(0x0008)
	TArray<class ADunDefTower_SummonEnemy*>            currentSelectedTowers;                                    // 0x0DBC(0x000C)
