#pragma once

// Dungeon Defenders (9.22) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class DunDefSpecial.DunDefBuff_Harbinger
// 0x0034 (0x0330 - 0x02FC)
class UDunDefBuff_Harbinger : public UDunDefBuff
{
public:
	TArray<int>                                        DifficultyTickDamageArray;                                // 0x02FC(0x000C) (Edit, NeedCtorLink)
	TArray<float>                                      DifficultyTickDamageMultiplierArray;                      // 0x0308(0x000C) (Edit, NeedCtorLink)
	float                                              HarbingerTimeoutRange;                                    // 0x0314(0x0004) (Edit)
	float                                              TickDamageMultiplier;                                     // 0x0318(0x0004) (Transient)
	float                                              Damage;                                                   // 0x031C(0x0004) (Edit)
	class UParticleSystem*                             BeamEmitterTemplate;                                      // 0x0320(0x0004) (Edit)
	class UParticleSystemComponent*                    beamInstance;                                             // 0x0324(0x0004) (ExportObject, Transient, Component, EditInline)
	class UClass*                                      TickDamageType;                                           // 0x0328(0x0004) (Edit)
	unsigned long                                      bDoLineOfSightCheck : 1;                                  // 0x032C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDefBuff_Harbinger");
		return ptr;
	}


	void DeactivateBuff();
	void BuffEffect();
	void Tick(float DeltaTime);
	void Initialize();
};


// Class DunDefSpecial.DunDefTower_SummonEnemy
// 0x015A (0x0972 - 0x0818)
class ADunDefTower_SummonEnemy : public ADunDefTower
{
public:
	struct FSummonedBoosts                             resistanceBoosting;                                       // 0x0818(0x0024) (Edit, NeedCtorLink)
	struct FSummonedBoosts                             movementSpeedBoosting;                                    // 0x083C(0x0024) (Edit, NeedCtorLink)
	struct FSummonedBoosts                             attackAnimSpeedBoosting;                                  // 0x0860(0x0024) (Edit, NeedCtorLink)
	TArray<TEnumAsByte<EPawnBoostType>>                allowedScalingTypes;                                      // 0x0884(0x000C) (Edit, NeedCtorLink)
	class ADunDefEnemy*                                myEnemyTemplate;                                          // 0x0890(0x0004) (Edit)
	class UTexture2D*                                  SelectedIcon;                                             // 0x0894(0x0004) (Edit)
	class UTexture2D*                                  PendingSelectionIcon;                                     // 0x0898(0x0004) (Edit)
	class UTexture2D*                                  CmdIcon_MoveDef;                                          // 0x089C(0x0004) (Edit)
	class UTexture2D*                                  CmdIcon_MoveOf;                                           // 0x08A0(0x0004) (Edit)
	class UTexture2D*                                  CmdIcon_Attack;                                           // 0x08A4(0x0004) (Edit)
	class UTexture2D*                                  CmdIcon_Follow;                                           // 0x08A8(0x0004) (Edit)
	class UTexture2D*                                  CmdIcon_HoldDef;                                          // 0x08AC(0x0004) (Edit)
	class UTexture2D*                                  CmdIcon_HoldOff;                                          // 0x08B0(0x0004) (Edit)
	class UTexture2D*                                  currentAttackTargetIcon;                                  // 0x08B4(0x0004) (Edit)
	class UTexture2D*                                  currentFollowTargetIcon;                                  // 0x08B8(0x0004) (Edit)
	class ADunDefEnemy*                                myEnemyReference;                                         // 0x08BC(0x0004) (Net, Transient)
	class ADunDefEnemyController*                      myEnemyControllerReference;                               // 0x08C0(0x0004) (Transient)
	class AActor*                                      currentTargetActor;                                       // 0x08C4(0x0004) (Net, Transient)
	class AActor*                                      pendingTargetActor;                                       // 0x08C8(0x0004) (Transient)
	unsigned long                                      bFollowOwner : 1;                                         // 0x08CC(0x0004) (Transient)
	unsigned long                                      bCheckForFollowReturn : 1;                                // 0x08CC(0x0004) (Transient)
	unsigned long                                      bAllowSelection : 1;                                      // 0x08CC(0x0004) (Edit)
	unsigned long                                      bDisableCommandIconDrawing : 1;                           // 0x08CC(0x0004) (Edit)
	unsigned long                                      bIsSelected : 1;                                          // 0x08CC(0x0004)
	unsigned long                                      bPendingSelection : 1;                                    // 0x08CC(0x0004)
	float                                              SelectedIconSize;                                         // 0x08D0(0x0004) (Edit)
	float                                              UpdateCommandRate;                                        // 0x08D4(0x0004) (Edit)
	struct FVector                                     SelectedIconOffset;                                       // 0x08D8(0x000C) (Edit)
	float                                              ResistanceMultiplier;                                     // 0x08E4(0x0004) (Net)
	float                                              AttackRangeMultiplier;                                    // 0x08E8(0x0004)
	float                                              MovementSpeedMult;                                        // 0x08EC(0x0004) (Net)
	float                                              AnimAttackSpeedMult;                                      // 0x08F0(0x0004) (Net)
	float                                              ReplicatedDmgValue;                                       // 0x08F4(0x0004) (Net)
	float                                              ReplicatedAtkRange;                                       // 0x08F8(0x0004) (Net)
	struct FString                                     ResistanceString;                                         // 0x08FC(0x000C) (Edit, Localized, NeedCtorLink)
	struct FString                                     MovementSpeedString;                                      // 0x0908(0x000C) (Edit, Localized, NeedCtorLink)
	struct FString                                     AnimSpeedString;                                          // 0x0914(0x000C) (Edit, Localized, NeedCtorLink)
	struct FString                                     AttackAnimSpeedString;                                    // 0x0920(0x000C) (Edit, Localized, NeedCtorLink)
	float                                              HoldOffensive_TargetableRange;                            // 0x092C(0x0004) (Edit)
	float                                              HoldDefensive_TargetableRange;                            // 0x0930(0x0004) (Edit)
	float                                              followIconZOffset;                                        // 0x0934(0x0004) (Edit)
	float                                              attackIconZOffset;                                        // 0x0938(0x0004) (Edit)
	class USoundCue*                                   AcceptOrderSound;                                         // 0x093C(0x0004) (Edit)
	class UParticleSystemComponent*                    SelectedParticle;                                         // 0x0940(0x0004) (Edit, ExportObject, Component, EditInline)
	class UParticleSystemComponent*                    pendingSelectedParticle;                                  // 0x0944(0x0004) (Edit, ExportObject, Component, EditInline)
	class UParticleSystemComponent*                    otherSelectedParticle;                                    // 0x0948(0x0004) (Edit, ExportObject, Component, EditInline)
	TArray<class AActor*>                              commandInstigators;                                       // 0x094C(0x000C) (NeedCtorLink)
	struct FVector                                     currentCommandPoint;                                      // 0x0958(0x000C)
	struct FVector                                     pendingCommandPoint;                                      // 0x0964(0x000C)
	TEnumAsByte<ESummonedCommand>                      currentCommand;                                           // 0x0970(0x0001) (Net)
	TEnumAsByte<ESummonedCommand>                      previousCommand;                                          // 0x0971(0x0001)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDefTower_SummonEnemy");
		return ptr;
	}


	void UpdateBuffValues();
	float GetAttackDamage();
	void SpawnDefaultBuffs();
	void ClientDisableMovementReplication(const struct FVector& endedLoc);
	void TransferTowerOwnership(class APawn* toPawn);
	bool ForceSingleMove(const struct FVector& NewLoc, const struct FRotator& NewRot, bool bShouldCollideWorld);
	bool ForceMoveActor(class AActor* Mover, const struct FVector& NewLoc);
	void GetAlternateAggroActor(TScriptInterface<class UDunDefTargetableInterface>* AltActor);
	float GetPlayerTargetingDesirability(class ADunDefPlayerController* forController, class ADunDefPlayer* ForPlayer);
	float GetTowerTargetingDesirability(class ADunDefTower* forTower);
	float GetEnemyTargetingDesirability(class AEngineNativeDunDefAIController* forController);
	void DrawToolTip(class UCanvas* C, int PosX, int PosY, class ULocalPlayer* ForPlayer);
	void DrawTowerToolTipStats(class UCanvas* C, float Opacity, class ULocalPlayer* ForPlayer, float canvasScale, float* PosX, float* PosY);
	struct FString GetBoostString(TEnumAsByte<EPawnBoostType> boostType);
	void GetBoostedTargets(TArray<class APawn*>* boostedTargets);
	void NotifyOfBoostedRemoval(class APawn* removedBoostee);
	float GetToolTipStatValue(TEnumAsByte<EPawnBoostType> boostType);
	float GetPawnBoostAmount(TEnumAsByte<EPawnBoostType> boostType);
	bool HasPawnBoostingType(TEnumAsByte<EPawnBoostType> boostType);
	void TakeDamage(int DamageAmount, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser, class UObject* WhatHitMe);
	class AActor* GetAlternateActor();
	int GetHealth(bool bGetMax);
	bool HealDamage(int Amount, class AController* Healer, class UClass* DamageType);
	void AddHealth(int howMuch, bool bDontDisplayFloatingNumber);
	float GetHealthPercent();
	void StartRepair();
	struct FString GetToolTipText();
	void ScaleForHeroModifiers(bool IsFirstTime);
	bool DrawMyHUD(class ADunDefHUD* H);
	void UpdateCommand();
	bool HandleCommand(class AActor* Target, TEnumAsByte<ESummonedCommand> NewCommand, const struct FVector& commandPoint);
	bool SetCommand(const struct FVector& commandPoint, TEnumAsByte<ESummonedCommand> NewCommand, class AActor* commandInstigator, class AActor* targetedActor);
	void SetSelected(bool bWantsSelected, class AActor* selectingActor);
	void SetPendingSelection(bool bIsPending);
	void CleanUpSummon();
	void Destroyed();
	void BaseChange();
	void SetUpEnemyValues(bool bInitialSetup);
	void SpawnMyEnemy();
	void InitializeForInstigator(class APawn* Pawn);
	float GetLastDamageTime();
	bool HasBeenRendered();
	void UpdateEnemyCollisionValues();
	void UpdateReplicatedStatValues();
	void ExecReplicatedFunction(const struct FName& FunctionName, const struct FName& nameParam1, const struct FName& nameParam2, class AActor* actorParam1, class AActor* actorParam2, const struct FVector& vecParam1, const struct FRotator& rotParam1, float floatParam1, float floatParam2, float floatParam3, float floatParam4, bool boolParam1, bool boolParam2, bool boolParam3, const struct FString& stringParam1, class UObject* objectParam1);
	void ReplicatedEvent(const struct FName& VarName);
};


// Class DunDefSpecial.DunDefEmitterDamage
// 0x005C (0x0330 - 0x02D4)
class ADunDefEmitterDamage : public ADunDefEmitterSpawnable
{
public:
	float                                              MaximumMassMomentumScale;                                 // 0x02D4(0x0004) (Edit)
	float                                              MassMomentumBaseScale;                                    // 0x02D8(0x0004) (Edit)
	float                                              MassMomentumScaleExponent;                                // 0x02DC(0x0004) (Edit)
	int                                                Damage;                                                   // 0x02E0(0x0004) (Edit, Net)
	float                                              Radius;                                                   // 0x02E4(0x0004) (Edit, Net)
	float                                              EffectRadius;                                             // 0x02E8(0x0004) (Edit)
	class UClass*                                      MyDamageType;                                             // 0x02EC(0x0004) (Edit)
	float                                              MyMomentum;                                               // 0x02F0(0x0004) (Edit, Net)
	float                                              DamageDelay;                                              // 0x02F4(0x0004) (Edit)
	float                                              ScalingHeroStatExponentDamage;                            // 0x02F8(0x0004) (Edit)
	float                                              ScalingHeroStatExponentRadius;                            // 0x02FC(0x0004) (Edit)
	float                                              DamageFalloffExponent;                                    // 0x0300(0x0004) (Edit)
	TEnumAsByte<ELevelUpValueType>                     ScalingHeroStatType;                                      // 0x0304(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0305(0x0003) MISSED OFFSET
	unsigned long                                      bUseAngleForDamage : 1;                                   // 0x0308(0x0004) (Edit)
	unsigned long                                      bUseOwnerAsInstigator : 1;                                // 0x0308(0x0004) (Edit)
	unsigned long                                      bScaleDrawScale : 1;                                      // 0x0308(0x0004) (Edit)
	unsigned long                                      bUseSelfAsDamageCauser : 1;                               // 0x0308(0x0004) (Edit)
	float                                              MaxTargetDeltaPitch;                                      // 0x030C(0x0004) (Edit, Net)
	float                                              MaxTargetDeltaYaw;                                        // 0x0310(0x0004) (Edit, Net)
	TArray<class UDunDefBuff*>                         BuffsToApplyOnHit;                                        // 0x0314(0x000C) (Edit, NeedCtorLink)
	class UDunDefBuff*                                 FirstTargetBuff;                                          // 0x0320(0x0004) (Edit)
	TScriptInterface<class UIActorModifierInterface>   MyActorStatModifier;                                      // 0x0324(0x0008) (Transient)
	float                                              PowerMult;                                                // 0x032C(0x0004) (Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDefEmitterDamage");
		return ptr;
	}


	class AActor* GetDamageCauser();
	bool CheckValidAngle(class AActor* Victim, const struct FVector& Origin);
	TScriptInterface<class UIActorModifierInterface> GetStatModifierObject();
	float GetStatValueByTag(float initalValue, const struct FString& StatTag, const TScriptInterface<class UIActorModifierInterface>& TagActor, TEnumAsByte<ELevelUpValueType> statType, bool bBaseValueOnly);
	void InitalizeActorStats(const TScriptInterface<class UIActorModifierInterface>& ActorStatObject, class UObject* CallingObject, int Tier, bool bBaseValueOnly);
	bool STATIC_AllowSpawn(class AActor* theArchetype, const struct FVector& theLoc, const struct FRotator& theRot);
	bool HurtRadius(float BaseDamage, float DamageRadius, class UClass* DamageType, float Momentum, const struct FVector& HurtOrigin, class AActor* IgnoredActor, class AController* InstigatedByController, bool bDoFullDamage);
	void DoDamage();
	void InitDamageEmitter(int BaseDamage, float BaseRange, const TScriptInterface<class UIActorModifierInterface>& aActorStatModifier);
	void PostBeginPlay();
};


// Class DunDefSpecial.CTF_PlayerAbility_PickupFlag
// 0x0008 (0x046C - 0x0464)
class ACTF_PlayerAbility_PickupFlag : public ADunDefPlayerAbility_GenericSpellTimer
{
public:
	class ACTF_Flag*                                   PickUpFlag;                                               // 0x0464(0x0004) (Net)
	class USoundCue*                                   StartPickingupSound;                                      // 0x0468(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_PlayerAbility_PickupFlag");
		return ptr;
	}


	void RequestPickup(class ACTF_Flag* newFlag);
};


// Class DunDefSpecial.CTF_Flag
// 0x00B4 (0x02D8 - 0x0224)
class ACTF_Flag : public ADunDefDroppedItem
{
public:
	float                                              PickupOffset;                                             // 0x0224(0x0004) (Edit)
	float                                              PickupWeighting;                                          // 0x0228(0x0004) (Edit)
	struct FColor                                      ToolTipDrawColor;                                         // 0x022C(0x0004) (Edit)
	struct FString                                     PickUpString;                                             // 0x0230(0x000C) (Edit, Localized, NeedCtorLink)
	float                                              ScorePerSecond;                                           // 0x023C(0x0004) (Edit)
	float                                              HoldTimeForScore;                                         // 0x0240(0x0004) (Edit)
	float                                              MaxPickupDistance;                                        // 0x0244(0x0004) (Edit)
	float                                              DamageMultiplierIncreaseSpeed;                            // 0x0248(0x0004) (Edit)
	float                                              HeldDamageMultiplier;                                     // 0x024C(0x0004) (Edit)
	float                                              MaxDamageMultiplier;                                      // 0x0250(0x0004) (Edit)
	float                                              DroppedAutoTeleportTime;                                  // 0x0254(0x0004) (Edit)
	float                                              WaypointIconOffscreenScale;                               // 0x0258(0x0004) (Edit)
	float                                              WaypointIconCenterScale;                                  // 0x025C(0x0004) (Edit)
	float                                              WaypointCenterYOffset;                                    // 0x0260(0x0004) (Edit)
	class USoundCue*                                   AllyPickedUpFlagSound;                                    // 0x0264(0x0004) (Edit)
	class USoundCue*                                   EnemyPickedUpFlagSound;                                   // 0x0268(0x0004) (Edit)
	class ADunDefEmitterSpawnable*                     PickedUpFlagEffects[0x2];                                 // 0x026C(0x0004) (Edit)
	class UParticleSystemComponent*                    DroppedParticleComponent;                                 // 0x0274(0x0004) (Edit, ExportObject, Component, EditInline)
	class UParticleSystemComponent*                    PickedUpParticleComponent;                                // 0x0278(0x0004) (Edit, ExportObject, Component, EditInline)
	class UParticleSystem*                             TeamFlagEffects[0x2];                                     // 0x027C(0x0004) (Edit)
	float                                              MiniMapIconSize;                                          // 0x0284(0x0004) (Edit)
	float                                              MinimumTowerDistance;                                     // 0x0288(0x0004) (Edit)
	float                                              OverlappingTowerCheckRadius;                              // 0x028C(0x0004) (Edit)
	float                                              HolderJumpZMultiplier;                                    // 0x0290(0x0004) (Edit)
	class UTexture2D*                                  MiniMapIcon;                                              // 0x0294(0x0004) (Edit)
	class UTexture2D*                                  OnScreenWaypointTexture;                                  // 0x0298(0x0004) (Edit)
	class UTexture2D*                                  OffScreenWaypointTexture;                                 // 0x029C(0x0004) (Edit)
	struct FColor                                      MiniMapDefaultColor;                                      // 0x02A0(0x0004) (Edit)
	class ADunDefPlayer*                               FlagHolder;                                               // 0x02A4(0x0004) (Net)
	float                                              currentScoreAccumulation;                                 // 0x02A8(0x0004)
	unsigned long                                      bIsPickedUp : 1;                                          // 0x02AC(0x0004)
	unsigned long                                      bGivePointsForPossesion : 1;                              // 0x02AC(0x0004) (Edit)
	unsigned long                                      bTeamBasedFlag : 1;                                       // 0x02AC(0x0004) (Edit)
	unsigned long                                      bAllowTeamReset : 1;                                      // 0x02AC(0x0004) (Edit)
	unsigned long                                      bAtBase : 1;                                              // 0x02AC(0x0004) (Net)
	class ACTF_FlagBase*                               myBase;                                                   // 0x02B0(0x0004) (Transient)
	int                                                myTeamIndex;                                              // 0x02B4(0x0004) (Edit, Net)
	int                                                CapturePoints;                                            // 0x02B8(0x0004) (Edit)
	struct FName                                       TeamParticleColorParam;                                   // 0x02BC(0x0008) (Edit)
	class ADunDefEmitterSpawnable*                     CapturedFlagEffects[0x2];                                 // 0x02C4(0x0004) (Edit)
	struct FString                                     flagCapturedMessage;                                      // 0x02CC(0x000C) (Edit, Localized, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_Flag");
		return ptr;
	}


	void SetAtBase(bool bIsAtBase);
	void SetDroppedParticleColor();
	void SetTeam(int NewTeam);
	void InitFlag(int NewTeam, class ACTF_FlagBase* NewBase);
	void AutoTeleport();
	void AdjustDamage(int* Damage);
	bool PreventTowerAtPoint(class ADunDefPlayerController* PC, class ADunDefTower* towerArch, const struct FVector& Point, float towerRadius);
	bool AllowTowerAtPoint(class ADunDefPlayerController* PC, class ADunDefTower* towerArch, const struct FVector& Point);
	bool CheckAllowance();
	void PhysicsVolumeChange(class APhysicsVolume* NewVolume);
	void FellOutOfWorld(class UClass* dmgType);
	void ResetCollision();
	void DisableCollision();
	bool IsInAuraOrTrap(const struct FVector& Loc);
	void CaptureFlag();
	void ReturnToBase();
	void DropFlag(bool bForceRandomizedPosition, bool bForceDroppedMessage);
	void PickUpFlag(class ADunDefPlayer* newHolder);
	void BeginBeingPickedUp(class ADunDefPlayerController* newHolder);
	bool CanBePickedUp(class ADunDefPlayerController* PC);
	void DrawMiniMapIcon(class UCanvas* Canvas, class ADunDefMiniMap* MiniMap);
	float GetActivationOffset();
	float GetActivationWeighting();
	void Client_Activate(class ADunDefPlayerController* PC, int activationType);
	void Server_Activate(class ADunDefPlayerController* PC, bool forceActivation, int activationType);
	int AllowActivation(class ADunDefPlayerController* PC, int activationType);
	int GetToolTipPriority();
	bool TakesToolTipPriority(const TScriptInterface<class UDunDefToolTipInterface>& otherToolTip);
	bool ContinueDrawingToolTip(bool ContinueDrawing);
	void DrawToolTip(class UCanvas* C, int PosX, int PosY, class ULocalPlayer* ForPlayer);
	void Destroyed();
	void PostBeginPlay();
	bool DrawMyHUD(class ADunDefHUD* H);
	bool OnlyDrawHUDForOwner();
	void ExecReplicatedFunction(const struct FName& FunctionName, const struct FName& nameParam1, const struct FName& nameParam2, class AActor* actorParam1, class AActor* actorParam2, const struct FVector& vecParam1, const struct FRotator& rotParam1, float floatParam1, float floatParam2, float floatParam3, float floatParam4, bool boolParam1, bool boolParam2, bool boolParam3, const struct FString& stringParam1, class UObject* objectParam1);
	void ReplicatedEvent(const struct FName& VarName);
};


// Class DunDefSpecial.CTF_UIGlobalHUD
// 0x0030 (0x0738 - 0x0708)
class UCTF_UIGlobalHUD : public UUI_GlobalHUD
{
public:
	class UUILabel*                                    MyTeamNameLabel;                                          // 0x0708(0x0004) (Edit)
	class UUIPanel*                                    ScorePanel_2;                                             // 0x070C(0x0004) (Edit)
	class UUIPanel*                                    ScorePanel_3;                                             // 0x0710(0x0004) (Edit)
	class UUILabel*                                    Team1PlayerList;                                          // 0x0714(0x0004) (Edit)
	class UUILabel*                                    Team2PlayerList;                                          // 0x0718(0x0004) (Edit)
	class UUILabel*                                    TeamName_2;                                               // 0x071C(0x0004) (Edit)
	class UUILabel*                                    TeamName_3;                                               // 0x0720(0x0004) (Edit)
	class UUILabel*                                    Team1ScoreList;                                           // 0x0724(0x0004) (Edit)
	class UUILabel*                                    Team2ScoreList;                                           // 0x0728(0x0004) (Edit)
	class UUILabel*                                    Team1KillList;                                            // 0x072C(0x0004) (Edit)
	class UUILabel*                                    Team2KillList;                                            // 0x0730(0x0004) (Edit)
	struct FColor                                      LocalPlayerHighLightColor;                                // 0x0734(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_UIGlobalHUD");
		return ptr;
	}


	void GetUITeamLists(int TeamOnlyCheck, struct FString* tList, struct FString* kList, struct FString* sList);
	struct FString GetColorString(const struct FColor& aColor);
	void UpdateTeamPanels();
	void Update(float DeltaTime);
	void UpdateCompetitive(float DeltaTime);
};


// Class DunDefSpecial.CTF_DDPRI
// 0x0010 (0x0380 - 0x0370)
class ACTF_DDPRI : public ADunDefPlayerReplicationInfo
{
public:
	int                                                CTF_MyCurrentTowerUnits;                                  // 0x0370(0x0004) (Net)
	int                                                CTF_MyMaxTowerUnits;                                      // 0x0374(0x0004) (Net)
	unsigned long                                      IsReadyToSpawn : 1;                                       // 0x0378(0x0004) (Net)
	int                                                MatchKills;                                               // 0x037C(0x0004) (Net, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_DDPRI");
		return ptr;
	}


	bool IsFriendlyToLocal();
	void PrintHeroLevelUpMessage();
	void PrintNewHeroMessage();
	void SetReadyToSpawn(bool bIsReady);
	struct FString GetTeamName();
	struct FColor GetTeamColor();
	void Destroyed();
	void AddToTeam(int TeamIndex);
	void ReplicatedEvent(const struct FName& VarName);
};


// Class DunDefSpecial.CTF_DDGRI
// 0x00EC (0x08CC - 0x07E0)
class ACTF_DDGRI : public ADDGRI_Competitive
{
public:
	struct FCTFTeamData                                CTFTeamDatas[0x2];                                        // 0x07E0(0x0034) (Net, NeedCtorLink)
	struct FColor                                      NeutralColor;                                             // 0x0848(0x0004)
	class ACTF_PlayerAbility_PickupFlag*               CTFPickupFlagAbilityTemplate;                             // 0x084C(0x0004)
	class UTexture2D*                                  TeamIconTexture;                                          // 0x0850(0x0004)
	class UTexture2D*                                  FlagIcon;                                                 // 0x0854(0x0004)
	class ACTF_Flag*                                   TheFlag;                                                  // 0x0858(0x0004) (Net)
	class ACTF_Flag*                                   TheSecondFlag;                                            // 0x085C(0x0004) (Net)
	struct FString                                     FlagIconPath;                                             // 0x0860(0x000C) (NeedCtorLink)
	int                                                WinningTeam;                                              // 0x086C(0x0004) (Net)
	unsigned long                                      bAutoBalanceTeams : 1;                                    // 0x0870(0x0004) (Net)
	unsigned long                                      bIsGameReady : 1;                                         // 0x0870(0x0004) (Net)
	unsigned long                                      bUsePersonalTowerUnits : 1;                               // 0x0870(0x0004)
	unsigned long                                      bAllowCountDown : 1;                                      // 0x0870(0x0004)
	unsigned long                                      bPrintWinningPlayerMessage : 1;                           // 0x0870(0x0004)
	unsigned long                                      bDisplayPlayerScore : 1;                                  // 0x0870(0x0004)
	float                                              GameStartTime;                                            // 0x0874(0x0004) (Net)
	float                                              FlagHoldingGroundSpeed;                                   // 0x0878(0x0004)
	int                                                LastSentGameTime;                                         // 0x087C(0x0004) (Transient)
	struct FString                                     EndGameLabelString;                                       // 0x0880(0x000C) (Localized, NeedCtorLink)
	int                                                WinCTFManaBonus[0x8];                                     // 0x088C(0x0004)
	int                                                WinExpBonus[0x8];                                         // 0x08AC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_DDGRI");
		return ptr;
	}


	bool AllowedToTeleport(class APawn* Teleportee);
	void DoDeathNotification(class ADunDefPlayerReplicationInfo* Killer, class ADunDefPlayerReplicationInfo* Victim, int damageTypeIndex);
	float GetJumpZMultiplier(class ADunDefPawn* aPawn);
	void ExtraDrawHUDInterface(class ADunDefHUD* H, const TScriptInterface<class UDunDefHUDInterface>& hudint);
	void CustomUpdatePlayerScoreLabel(class ULocalPlayer* ForPlayer, class UUILabel_ScoreIndicator* ScoreLabel);
	bool AllowDeathSpectatorMode(class ADunDefPlayerController* PC);
	float ModifyPlayerGroundSpeed(class ADunDefPlayer* aPlayer, float theGroundSpeed);
	struct FColor GetGameOverLabelColor();
	struct FColor GetVictoryLabelColor();
	struct FString GetGameOverLabelString(class APlayerReplicationInfo* myPlayer);
	struct FString GetVictoryLabelString(class APlayerReplicationInfo* myPlayer);
	bool OverrideEndGameLabel();
	class ADunDefPlayerReplicationInfo* GetWinningPRI();
	TArray<TScriptInterface<class UDataListEntryInterface>> GetDataListEntries(int dataSetType, int PlayerIndex, int FolderID);
	void GetTeamIcon(int TeamIndex, class USurface** theTeamIcon, struct FColor* theTeamColor);
	bool IsTeamCompetitive();
	bool AllowChatBetween(class APlayerReplicationInfo* myPlayer, class APlayerReplicationInfo* TheirPlayer);
	int GetTeamThatHasFlag();
	void DoLevelVictory();
	void GiveWinningBonus();
	void WonGame(class ADunDefPlayerReplicationInfo* theWinningPlayer, int WinningTeamIndex);
	void CheckAllReady();
	bool CheckReadyPlayers();
	void SetAllowCountDown(bool setAllow);
	bool AllowGameCountDown();
	void SetGameReady();
	void SetGameTime(float NewTime);
	void UpdateGameTime();
	void Tick(float DeltaTime);
	void FilloutTeams();
	void FlushTeams();
	void AutoBalanceTeams();
	void AutoSortTeams();
	int GetLowestBalancedTeam();
	void IncrementTeamScore(int ScoringTeam, int Score);
	void PostBeginPlay();
	void ModifyCustomColors(class ADunDefPlayerController* aController, class ADunDefPlayer* aPlayer);
	void DrawExtraPlayerFloatingHUD(class ADunDefPlayer* aPlayer, class ADunDefHUD* H);
	struct FString GetTeamScores();
	void Server_AddGRIHeroAbilities(class ADunDefPlayerController* PC);
	struct FString GetColorString(const struct FColor& aColor);
	struct FString GetTeamLists(int TeamOnlyCheck, bool bWantsReadyCheck);
	struct FString GetCompetitivePlayerList();
	bool DestroyTowerOnOwnerLeft(class ADunDefTower* aTower);
	int GetMaxTowerUnits(class ADunDefPlayerReplicationInfo* ddPRI);
	int GetAltCurrentTowerUnits(class ADunDefPlayerReplicationInfo* ddPRI);
	int GetCurrentTowerUnits(class ADunDefPlayerReplicationInfo* ddPRI);
	bool CanPlaceTowerUnitCost(int Cost, class ADunDefPlayerController* ForPlayer, class ADunDefTower* Tower);
	void RemovedTower(class ADunDefTower* Tower);
	void AddedTower(class ADunDefTower* Tower);
	void RemovePlayerFromTeam(class ACTF_DDPRI* aPRI, int TeamIndex);
	void AddPlayerToTeam(class ACTF_DDPRI* aPRI, int TeamIndex);
	void RemoveFromAnyTeams(class ACTF_DDPRI* aPRI);
	int GetSmallestTeam();
	void ExecReplicatedFunction(const struct FName& FunctionName, const struct FName& nameParam1, const struct FName& nameParam2, class AActor* actorParam1, class AActor* actorParam2, const struct FVector& vecParam1, const struct FRotator& rotParam1, float floatParam1, float floatParam2, float floatParam3, float floatParam4, bool boolParam1, bool boolParam2, bool boolParam3, const struct FString& stringParam1, class UObject* objectParam1);
};


// Class DunDefSpecial.CTF_DDPC
// 0x0008 (0x0B40 - 0x0B38)
class ACTF_DDPC : public ADunDefPlayerController
{
public:
	class UUI_TeamSelect*                              TeamSelectUITemplate;                                     // 0x0B38(0x0004) (Edit)
	class ACTF_Flag*                                   myHeldFlag;                                               // 0x0B3C(0x0004) (Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_DDPC");
		return ptr;
	}


	void AdjustDamage(class AController* InstigatedBy, const struct FVector& HitLocation, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class UObject* WhatHitMe, int* inDamage, struct FVector* Momentum);
	void PawnDied(class APawn* inPawn);
	void GiveFlag(class ACTF_Flag* newFlag);
	void SetIsReady(bool bIsReady);
	void SetDesiredTeam(int desiredTeam);
	void CreateHUD();
	void LocalAttemptSpawn();
	void ServerRestartPlayer();
	void ShowTeamSelectionUI();
};


// Class DunDefSpecial.CTD_DDGRI
// 0x000C (0x08D8 - 0x08CC)
class ACTD_DDGRI : public ACTF_DDGRI
{
public:
	TArray<float>                                      MoveRepSizes;                                             // 0x08CC(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTD_DDGRI");
		return ptr;
	}


	bool AllowedToTeleport(class APawn* Teleportee);
	void DoLevelVictory();
	void Tick(float DeltaTime);
	struct FString GetSkipBuildPhaseString();
	void DrawExtraPlayerFloatingHUD(class ADunDefPlayer* aPlayer, class ADunDefHUD* H);
	void Server_AddGRIHeroAbilities(class ADunDefPlayerController* PC);
	bool DestroyTowerOnOwnerLeft(class ADunDefTower* aTower);
	bool AllowActivatingCrystal();
	void SetGameReady();
};


// Class DunDefSpecial.UI_TeamSelect
// 0x002C (0x0668 - 0x063C)
class UUI_TeamSelect : public UDunDefUIScene
{
public:
	class UUIScriptWidget_Button*                      ReadyButton;                                              // 0x063C(0x0004) (Edit)
	class UUIButton_Scripted*                          SwapTeamButton;                                           // 0x0640(0x0004) (Edit)
	class UUIButton_Scripted*                          AutoSetTeams;                                             // 0x0644(0x0004) (Edit)
	class UUIButton_Scripted*                          TeamButton_2;                                             // 0x0648(0x0004) (Edit)
	class UUIButton_Scripted*                          TeamButton_3;                                             // 0x064C(0x0004) (Edit)
	class UUILabel*                                    GameStartCountdown;                                       // 0x0650(0x0004) (Edit)
	class UUILabel*                                    Team1PlayerList;                                          // 0x0654(0x0004) (Edit)
	class UUILabel*                                    Team2PlayerList;                                          // 0x0658(0x0004) (Edit)
	class UUILabel*                                    TeamName_2;                                               // 0x065C(0x0004) (Edit)
	class UUILabel*                                    TeamName_3;                                               // 0x0660(0x0004) (Edit)
	float                                              GameStartTime;                                            // 0x0664(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.UI_TeamSelect");
		return ptr;
	}


	bool OnInterceptedInputKey(struct FInputEventParameters* EventParms);
	bool NotifyWidgetClicked(class UUIObject* Widget);
	void Update(float DeltaTime);
	void SceneActivated(bool bInitialActivation);
};


// Class DunDefSpecial.CTF_GameInfo
// 0x0008 (0x0554 - 0x054C)
class ACTF_GameInfo : public AGameInfo_Competitive
{
public:
	int                                                TeamPointsForKill;                                        // 0x054C(0x0004)
	unsigned long                                      bPreventCompetitivePlayerDamage : 1;                      // 0x0550(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_GameInfo");
		return ptr;
	}


	void AdjustDTDamage(class ADunDefDamageableTarget* forDT, class AController* InstigatedBy, const struct FVector& HitLocation, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, int* inDamage, struct FVector* Momentum);
	void AdjustPawnDamage(class ADunDefPawn* forPawn, class AController* InstigatedBy, const struct FVector& HitLocation, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, int* inDamage, struct FVector* Momentum);
	unsigned char GetPlayerTeamForStart(class AController* Player, unsigned char InTeam);
	bool CheckScore(class APlayerReplicationInfo* Scorer);
	void ScoreKill(class AController* Killer, class AController* Other);
	void ScoreObjective(class APlayerReplicationInfo* Scorer, int Score);
	void AddObjectiveScore(class APlayerReplicationInfo* Scorer, int Score);
	void PlayerReplicationInfoInitialized(class ADunDefPlayerController* PC);
	void DoPlayerLeaving(class ADunDefPlayerController* PC, bool bForceLocal);
	class APlayerController* SpawnPlayerController(const struct FVector& SpawnLocation, const struct FRotator& SpawnRotation);
};


// Class DunDefSpecial.CTD_GameInfo
// 0x000C (0x0560 - 0x0554)
class ACTD_GameInfo : public ACTF_GameInfo
{
public:
	TArray<float>                                      OgreDifficultyOffsets;                                    // 0x0554(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTD_GameInfo");
		return ptr;
	}


	class ADunDefEnemy* WaveSpawnerCreateEnemy(class UDunDef_SeqAct_EnemyWaveSpawner* aSpawner, class ADunDefEnemy* EnemyTemplate, const struct FVector& SpawnLocation, const struct FRotator& SpawnRotation);
	float RatePlayerStart(class APlayerStart* P, unsigned char Team, class AController* Player);
	void PostBeginPlay();
};


// Class DunDefSpecial.CTF_FlagBase
// 0x0068 (0x0284 - 0x021C)
class ACTF_FlagBase : public AActor
{
public:
	int                                                myTeamIndex;                                              // 0x021C(0x0004) (Edit, Net)
	class ADunDefEmitterSpawnable*                     CaptureEmitterTemplate[0x2];                              // 0x0220(0x0004) (Edit)
	class ADunDefEmitterSpawnable*                     FlagStoleEmitterTemplate[0x2];                            // 0x0228(0x0004) (Edit)
	class UParticleSystemComponent*                    MyParticleComponent;                                      // 0x0230(0x0004) (Edit, ExportObject, Component, EditInline)
	class ACTF_Flag*                                   myFlagTemplate;                                           // 0x0234(0x0004) (Edit)
	struct FName                                       ParticleColorName;                                        // 0x0238(0x0008) (Edit)
	TArray<class APlayerStart*>                        myAssociatedStarts;                                       // 0x0240(0x000C) (Edit, NeedCtorLink)
	TArray<class ADunDefTeamTowerVolume*>              myAssociatedVolumes;                                      // 0x024C(0x000C) (Edit, NeedCtorLink)
	class ACTF_Flag*                                   myFlag;                                                   // 0x0258(0x0004) (Transient)
	unsigned long                                      bBaseInited : 1;                                          // 0x025C(0x0004) (Net)
	class UCylinderComponent*                          myCollisionComponent;                                     // 0x0260(0x0004) (ExportObject, Component, EditInline)
	float                                              MiniMapIconSize;                                          // 0x0264(0x0004) (Edit)
	float                                              MinimumTowerDistance;                                     // 0x0268(0x0004) (Edit)
	class UTexture2D*                                  MiniMapIcon;                                              // 0x026C(0x0004) (Edit)
	TArray<class UMaterialInstanceConstant*>           ZoneMICs;                                                 // 0x0270(0x000C) (Edit, NeedCtorLink)
	struct FName                                       ZoneMICParamName;                                         // 0x027C(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_FlagBase");
		return ptr;
	}


	bool PreventTowerAtPoint(class ADunDefPlayerController* PC, class ADunDefTower* towerArch, const struct FVector& Point, float towerRadius);
	bool AllowTowerAtPoint(class ADunDefPlayerController* PC, class ADunDefTower* towerArch, const struct FVector& Point);
	bool CheckAllowance();
	void DrawMiniMapIcon(class UCanvas* Canvas, class ADunDefMiniMap* MiniMap);
	void SpawnFlag();
	void FlagTaken();
	void FlagReturned();
	void DoCaptureEffects();
	void ScoreFlag(class ACTF_Flag* scoredFlag);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
	void InitBase();
	void SetTeamIndex(int NewTeam);
	void PostBeginPlay();
	void ExecReplicatedFunction(const struct FName& FunctionName, const struct FName& nameParam1, const struct FName& nameParam2, class AActor* actorParam1, class AActor* actorParam2, const struct FVector& vecParam1, const struct FRotator& rotParam1, float floatParam1, float floatParam2, float floatParam3, float floatParam4, bool boolParam1, bool boolParam2, bool boolParam3, const struct FString& stringParam1, class UObject* objectParam1);
	void ReplicatedEvent(const struct FName& VarName);
};


// Class DunDefSpecial.CTF_MultiFlag_GameInfo
// 0x0004 (0x0558 - 0x0554)
class ACTF_MultiFlag_GameInfo : public ACTF_GameInfo
{
public:
	unsigned long                                      bSetRandomTeamSides : 1;                                  // 0x0554(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_MultiFlag_GameInfo");
		return ptr;
	}


	float RatePlayerStart(class APlayerStart* P, unsigned char Team, class AController* Player);
	void PostBeginPlay();
};


// Class DunDefSpecial.DunDefTeamTowerVolume
// 0x0004 (0x025C - 0x0258)
class ADunDefTeamTowerVolume : public AVolume
{
public:
	int                                                myTeamIndex;                                              // 0x0258(0x0004) (Edit, Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDefTeamTowerVolume");
		return ptr;
	}


	void SetMyTeam(int NewTeam);
	void Destroyed();
	void PostBeginPlay();
	bool AllowTowerAtPoint(class ADunDefPlayerController* PC, class ADunDefTower* towerArch, const struct FVector& Point);
	bool PreventTowerAtPoint(class ADunDefPlayerController* PC, class ADunDefTower* towerArch, const struct FVector& Point, float towerRadius);
	bool CheckAllowance();
	void ExecReplicatedFunction(const struct FName& FunctionName, const struct FName& nameParam1, const struct FName& nameParam2, class AActor* actorParam1, class AActor* actorParam2, const struct FVector& vecParam1, const struct FRotator& rotParam1, float floatParam1, float floatParam2, float floatParam3, float floatParam4, bool boolParam1, bool boolParam2, bool boolParam3, const struct FString& stringParam1, class UObject* objectParam1);
};


// Class DunDefSpecial.CTFM_DDGRI
// 0x0000 (0x08CC - 0x08CC)
class ACTFM_DDGRI : public ACTF_DDGRI
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTFM_DDGRI");
		return ptr;
	}

};


// Class DunDefSpecial.CTF_UIGameStats
// 0x0024 (0x0FE4 - 0x0FC0)
class UCTF_UIGameStats : public UUI_GameStats
{
public:
	class UUILabel*                                    Team1PlayerList;                                          // 0x0FC0(0x0004) (Edit)
	class UUILabel*                                    Team2PlayerList;                                          // 0x0FC4(0x0004) (Edit)
	class UUILabel*                                    TeamName_2;                                               // 0x0FC8(0x0004) (Edit)
	class UUILabel*                                    TeamName_3;                                               // 0x0FCC(0x0004) (Edit)
	class UUILabel*                                    Team1ScoreList;                                           // 0x0FD0(0x0004) (Edit)
	class UUILabel*                                    Team2ScoreList;                                           // 0x0FD4(0x0004) (Edit)
	class UUILabel*                                    Team1KillList;                                            // 0x0FD8(0x0004) (Edit)
	class UUILabel*                                    Team2KillList;                                            // 0x0FDC(0x0004) (Edit)
	struct FColor                                      LocalPlayerHighLightColor;                                // 0x0FE0(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.CTF_UIGameStats");
		return ptr;
	}


	void GetUITeamLists(int TeamOnlyCheck, struct FString* tList, struct FString* kList, struct FString* sList);
	struct FString GetColorString(const struct FColor& aColor);
	void UpdateTeamPanels();
	void CustomInit(int CustomInitIndex);
};


// Class DunDefSpecial.DunDef_SeqAct_AddPlatformToVerticalTowerMover
// 0x0000 (0x00E8 - 0x00E8)
class UDunDef_SeqAct_AddPlatformToVerticalTowerMover : public USequenceAction
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDef_SeqAct_AddPlatformToVerticalTowerMover");
		return ptr;
	}


	void Activated();
};


// Class DunDefSpecial.DunDef_VerticalTowerMover
// 0x0014 (0x0230 - 0x021C)
class ADunDef_VerticalTowerMover : public AActor
{
public:
	unsigned long                                      bBuildPhaseOnly : 1;                                      // 0x021C(0x0004) (Edit)
	TArray<struct FPlatformInfo>                       Platforms;                                                // 0x0220(0x000C) (Transient, NeedCtorLink)
	int                                                TicksSinceUpdate;                                         // 0x022C(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDef_VerticalTowerMover");
		return ptr;
	}


	void Tick(float DeltaTime);
	void MoveTowers(const struct FPlatformInfo& Info);
	TArray<struct FTowerInfo> RebuildTowerCache(const struct FPlatformInfo& thePlatformInfo);
	void AddInterpActor(class AInterpActor* TheActor);
};


// Class DunDefSpecial.DunDef_SeqAct_CheckToUnlockAchievements
// 0x0001 (0x00E9 - 0x00E8)
class UDunDef_SeqAct_CheckToUnlockAchievements : public USequenceAction
{
public:
	TEnumAsByte<EAchievementCheckSet>                  AchievementCheckSet;                                      // 0x00E8(0x0001) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDef_SeqAct_CheckToUnlockAchievements");
		return ptr;
	}


	void Activated();
};


// Class DunDefSpecial.DunDef_SeqAct_CTDWinGameForTeam
// 0x0004 (0x00EC - 0x00E8)
class UDunDef_SeqAct_CTDWinGameForTeam : public USequenceAction
{
public:
	int                                                WinningTeamIndex;                                         // 0x00E8(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDef_SeqAct_CTDWinGameForTeam");
		return ptr;
	}


	void Activated();
};


// Class DunDefSpecial.DunDef_SeqAct_GetMVP
// 0x0000 (0x00E8 - 0x00E8)
class UDunDef_SeqAct_GetMVP : public USequenceAction
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDef_SeqAct_GetMVP");
		return ptr;
	}


	void Activated();
};


// Class DunDefSpecial.DunDef_SeqAct_HideGlobalUIScene
// 0x0008 (0x00F0 - 0x00E8)
class UDunDef_SeqAct_HideGlobalUIScene : public USequenceAction
{
public:
	class UDunDefUIScene*                              aUIScene;                                                 // 0x00E8(0x0004) (Edit)
	unsigned long                                      bForceClose : 1;                                          // 0x00EC(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class DunDefSpecial.DunDef_SeqAct_HideGlobalUIScene");
		return ptr;
	}


	void Activated();
};


// Class DunDefSpecial.DunDefTower_TripWire
// 0x0100 (0x09E4 - 0x08E4)
class ADunDefTower_TripWire : public ADunDefTower_DetonationType
{
public:
	TArray<struct FBeamTrippers>                       currentBeamTrippers;                                      // 0x08E4(0x000C) (Component, NeedCtorLink)
	TArray<class ADunDefTower_TripWire*>               ChildNodes;                                               // 0x08F0(0x000C) (NeedCtorLink)
	class ADunDefTower_TripWire*                       ChildNode;                                                // 0x08FC(0x0004) (Net)
	unsigned long                                      bIsChildNode : 1;                                         // 0x0900(0x0004) (Net)
	unsigned long                                      bUseDetonation : 1;                                       // 0x0900(0x0004) (Edit)
	unsigned long                                      bShowInactiveEffectOnDeactivate : 1;                      // 0x0900(0x0004) (Edit)
	unsigned long                                      bActiveDamage : 1;                                        // 0x0900(0x0004) (Net)
	unsigned long                                      bShutDown : 1;                                            // 0x0900(0x0004) (Net)
	unsigned long                                      bDoesStun : 1;                                            // 0x0900(0x0004) (Edit)
	unsigned long                                      bContinuousProcs : 1;                                     // 0x0900(0x0004) (Edit)
	unsigned long                                      bAllowTargeting : 1;                                      // 0x0900(0x0004) (Edit)
	unsigned long                                      bDoesTracing : 1;                                         // 0x0900(0x0004) (Edit)
	unsigned long                                      bActiveOnStart : 1;                                       // 0x0900(0x0004) (Edit)
	unsigned long                                      bWantsChildTodrawUpgradeOverlay : 1;                      // 0x0900(0x0004) (Edit)
	unsigned long                                      bSetFullCollisionForChild : 1;                            // 0x0900(0x0004) (Edit)
	unsigned long                                      bDoClientTrace : 1;                                       // 0x0900(0x0004) (Edit)
	unsigned long                                      bMoving : 1;                                              // 0x0900(0x0004) (Net)
	unsigned long                                      bDidSingleHit : 1;                                        // 0x0900(0x0004)
	class ADunDefTower_TripWire*                       ParentNode;                                               // 0x0904(0x0004) (Net)
	float                                              WireDistanceForMaxCost;                                   // 0x0908(0x0004) (Edit)
	float                                              WireDistanceForMinCost;                                   // 0x090C(0x0004) (Edit)
	int                                                TowerUnitCostMax;                                         // 0x0910(0x0004) (Edit)
	struct FVector                                     BeamTraceExtent;                                          // 0x0914(0x000C) (Edit)
	float                                              ActiveEffectLingerTime;                                   // 0x0920(0x0004) (Edit)
	class UParticleSystemComponent*                    BeamEffect;                                               // 0x0924(0x0004) (Edit, ExportObject, Component, EditInline)
	class UParticleSystemComponent*                    InActiveBeamEffect;                                       // 0x0928(0x0004) (Edit, ExportObject, Component, EditInline)
	class UParticleSystemComponent*                    InActiveBeamEndPointEffect;                               // 0x092C(0x0004) (Edit, ExportObject, Component, EditInline)
	class UParticleSystemComponent*                    ActiveBeamEndPointEffect;                                 // 0x0930(0x0004) (Edit, ExportObject, Component, EditInline)
	class UParticleSystemComponent*                    PreDetonationEndPointEffect;                              // 0x0934(0x0004) (Edit, ExportObject, Component, EditInline)
	struct FName                                       BeamSocketName;                                           // 0x0938(0x0008) (Edit)
	int                                                BaseDamagePerTick;                                        // 0x0940(0x0004) (Edit)
	float                                              DmgProcInterval;                                          // 0x0944(0x0004) (Edit)
	float                                              ActiveDuration;                                           // 0x0948(0x0004) (Edit)
	class UClass*                                      BeamDamageType;                                           // 0x094C(0x0004) (Edit)
	float                                              TimeTillDetonate;                                         // 0x0950(0x0004) (Edit)
	float                                              LifeEnergy;                                               // 0x0954(0x0004) (Edit, Net)
	float                                              LifeEnergyDecrease;                                       // 0x0958(0x0004) (Edit)
	float                                              LifeEnergyDecreasePerPawnAffected;                        // 0x095C(0x0004) (Edit)
	float                                              HealAmountMultiplier;                                     // 0x0960(0x0004) (Edit)
	float                                              NetUpdateFrequencyWhenRepairing;                          // 0x0964(0x0004) (Edit)
	float                                              LastRepairIncrementTime;                                  // 0x0968(0x0004)
	int                                                MaxLifeEnergy;                                            // 0x096C(0x0004) (Net)
	TArray<class UClass*>                              NoStunDamageTypes;                                        // 0x0970(0x000C) (Edit, NeedCtorLink)
	class UParticleSystem*                             StunnedEffect;                                            // 0x097C(0x0004) (Edit)
	float                                              BaseStunTime;                                             // 0x0980(0x0004) (Edit)
	float                                              MaxZHeight;                                               // 0x0984(0x0004) (Edit)
	float                                              MinZHeight;                                               // 0x0988(0x0004) (Edit)
	class UTexture2D*                                  MiniMapBeamTexture;                                       // 0x098C(0x0004) (Edit)
	float                                              MiniMapBeamWidth;                                         // 0x0990(0x0004) (Edit)
	float                                              StunTimeExponent;                                         // 0x0994(0x0004) (Edit)
	TEnumAsByte<ELevelUpValueType>                     StunStat;                                                 // 0x0998(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0999(0x0003) MISSED OFFSET
	class USoundCue*                                   DetonateSound;                                            // 0x099C(0x0004) (Edit)
